// 服务协议
const agreement = {
  agreementText: [
    // 餐宴类
    {
      bigType: '餐宴类',
      typeList: [{
        typeExplain: "“保洁服务”说明",
        type: "餐宴",
        list: [
          //
          {
            title: "1.“餐宴类”服务内容",
            text: [
              "1.1日常三餐；针对各类人群的营养餐；中式家宴；西式自助宴会以及其他宴会形式。（餐宴类服务不局限于日常餐饮及宴会，如有其他餐饮需求，可联系客服询问。）",
              "1.2做饭师的服务内容不包含：a)代买菜业务，如需要代为买菜，则买菜时间计入相应的服务时间，因此将可能导致服务时间减少或者服务内容缺失；b) 功能性药材（如冬虫夏草等）的处理以及药膳的烹饪; c) 危险性或珍稀动植物的处理及烹饪；d)厨房电器的拆装清洗，如需要外部清洗，可提前告知服务人员；如您需要增加服务人员（如增加做饭师数量），可与专属家政顾问联系。做饭师的餐点一般而言包含xxxxx,但不负责西式糕点等特殊食物制作，如需进行西点、咖啡等制作，可联系专属家政顾问。",
              "1.3提供宴会类服务前，需与服务人员沟通相关细节、家宴类型、所呈现效果等等。由于家宴类准备时间较长，如对菜品上桌顺序有特殊要求，请提前告知，否则以常规方式准备。一般家宴类分为前菜、主菜及餐后甜点。"
            ]
          },
          {
            title: "2.服务规则",
            text: [
              "2.1 未经嘉美美家允许，不得将本服务全部或部分转让给第三方或变更服务地址。若您自行转让给第三方或者变更服务地址，嘉美美家有权不提供服务且不退换未使用服务的剩余款项。",
              "2.2上门服务时间分为两档：一般为上午8:30-12:00以及下午13:00-18:00（如有特殊时间要求，可另行沟通），服务时间及时长由所提交订单决定。如无特殊情况，请勿随意调整服务时间。",
            ]
          },
          {
            title: "3.服务人员",
            text: [
              "3.1在服务期间，如服务人员不可避免存在“生病”、“离职”等特殊情况，无法为您提供服务，嘉美美家将提前通知您，并与您沟通后提交新的应急措施（如改期、更换服务人员等）。",
              "3.2身份标识：如您对服务人员的身份产生任何疑问，可根据单号确认。服务人员的服务单号与您手机订单内的服务单号保持一致。若有其他相关身份上的疑问，可联系相关客服解决。"
            ]
          },
          {
            title: "4.安全责任",
            text: [
              "4.1服务人员在服务期间，由于自身原因导致发生意外事故或人身伤害，由嘉美美家负责赔偿。若因您或可归结为您的原因导致发生意外或人身伤害等，由您负责赔偿。请看管好饲养的宠物，若因您饲养的宠物导致服务人员受伤，产生的合理相关费用由您支付赔偿。",
              "4.2您有义务在服务完成后做财产安全验收，并根据实际情况如实反馈“物品是否安好”，若因服务人员导致物品损坏或者丢失，由服务人员与嘉美美家共同承担责任。若您委托服务人员进行服务（用户未在家中并确认财产安全），事后发现物品丢失或损坏，请在24小时内联系客服或者拨打电话xxxxxxxxxx,否则不予处理。",
              "4.3由于家庭服务的特殊性，以及风险的不可预估性，若服务期间导致物品的损失，嘉美美家对于财务损坏的赔偿原则上不超过本次服务价款的3倍。若因服务人员的非主观原因导致相关家电损坏等，由服务人员及嘉美美家承担相应责任，敬请谅解（注：家电操作各不相同，如条件允许，可对服务人员进行简单讲解）。",
              "4.4其他条款（根据服务性质有需要添加）"
            ]
          },
          {
            title: "5.违约及赔偿责任",
            text: [
              "嘉美美家服务人员如在服务期间有违法行为或者因个人原因对您造成损失的，嘉美美家有义务及时处理问题并承担相应责任。"
            ]
          },
          {
            title: "6.争议解决",
            text: [
              "嘉美美家与您如因服务产生分歧，应当相互沟通协商解决。如协商不成，则您可向相关机构申请调解。"
            ]
          },
        ],
      }]
    },
    // 插花
    {
      bigType: '插花类',
      typeList: [{
        typeExplain: "“保洁服务”说明",
        type: "插花",
        list: [
          // 
          {
            title: "1.“餐宴类”服务内容",
            text: [
              "1.1根据房屋风格、家庭喜好等因素对已有的花材进行设计和包装。插花喜好因人而异，具有主观性，凡是以不喜欢/购买花材不新鲜等为原因要求退款则一律拒绝",
            ]
          },
          {
            title: "2.服务规则",
            text: [
              "2.1 未经嘉美美家允许，不得将本服务全部或部分转让给第三方或变更服务地址。若您自行转让给第三方或者变更服务地址，嘉美美家有权不提供服务且不退换未使用服务的剩余款项。",
              "2.2上门服务时间分为两档：上午8:30-12:00以及下午13:00-18:00，服务时间及时长由所提交订单决定。如无特殊情况，请勿随意调整服务时间。",
              "2.3提供代为购买花材业务，可告知服务人员特定的花店、花材以及数量，购花所需费用由客户自行支付，不包含在服务费之内。此业务根据花店距离等因素另外结算代购费用。"
            ]
          },
          {
            title: "3.服务人员",
            text: [
              "3.1在服务期间，如服务人员不可避免存在“生病”、“离职”等特殊情况，无法为您提供服务，嘉美美家将提前通知您，并与您沟通后提交新的应急措施（如改期、更换服务人员等）。",
              "3.2身份标识：如您对服务人员的身份产生任何疑问，可根据单号确认。服务人员的服务单号与您手机订单内的服务单号保持一致。若有其他相关身份上的疑问，可联系相关客服解决。"
            ]
          },
          {
            title: "4.安全责任",
            text: [
              "4.1服务人员在服务期间，由于自身原因导致发生意外事故或人身伤害，由嘉美美家负责赔偿。若因您或可归结为您的原因导致发生意外或人身伤害等，由您负责赔偿。请看管好饲养的宠物，若因您饲养的宠物导致服务人员受伤，产生的合理相关费用由您支付赔偿。",
              "4.2您有义务在服务完成后做财产安全验收，并根据实际情况如实反馈“物品是否安好”，若因服务人员导致物品损坏或者丢失，由服务人员与嘉美美家共同承担责任。若您委托服务人员进行服务（用户未在家中并确认财产安全），事后发现物品丢失或损坏，请在24小时内联系客服或者拨打电话xxxxxxxxxx,否则不予处理。",
              "4.3由于家庭服务的特殊性，以及风险的不可预估性，若服务期间导致物品的损失，嘉美美家对于财务损坏的赔偿原则上不超过本次服务价款的3倍。若因服务人员的非主观原因导致相关家电损坏等，由服务人员及嘉美美家承担相应责任，敬请谅解（注：家电操作各不相同，如条件允许，可对服务人员进行简单讲解）。",
              "4.4其他条款（根据服务性质有需要添加）"
            ]
          },
          {
            title: "5.违约及赔偿责任",
            text: [
              "嘉美美家服务人员如在服务期间有违法行为或者因个人原因对您造成损失的，嘉美美家有义务及时处理问题并承担相应责任。"
            ]
          },
          {
            title: "6.争议解决",
            text: [
              "嘉美美家与您如因服务产生分歧，应当相互沟通协商解决。如协商不成，则您可向相关机构申请调解。"
            ]
          },
        ],
      }]
    },
    // 保洁
    {
      bigType: '保洁类',
      typeList: [{
        typeExplain: "“保洁服务”说明",
        type: "保洁",
        list: [
          // 
          {
            title: "1.“保洁类”服务内容",
            text: ["1.1全屋保洁；指定区域保洁；地毯清洗及养护；玻璃清洗等（以上任意服务内容皆可选择），清洁方式分为日常保洁和深度保洁两种。"]
          },
          {
            title: "服务规则",
            text: [
              "2.1 未经嘉美美家允许，不得将本服务全部或部分转让给第三方或变更服务地址。若您自行转让给第三方或者变更服务地址，嘉美美家有权不提供服务且不退换未使用服务的剩余款项。",
              "2.2上门服务时间分为两档：上午8:30-12:00以及下午13:00-18:00，服务时间及时长由所提交订单决定。如无特殊情况，请勿随意调整服务时间。",
              "2.3服务人员均自带统一清洗工具。每个家庭的xx清洁程度根据实际情况各有差异，您可根据需要选择所需的产品服务，由于清洁程度具有主观性，嘉美美家将按照要求完成日常标准的清洁工作。"
            ]
          },
          {
            title: "3.服务人员",
            text: [
              "3.1在服务期间，如服务人员不可避免存在“生病”、“离职”等特殊情况，无法为您提供服务，嘉美美家将提前通知您，并与您沟通后提交新的应急措施（如改期、更换服务人员等）。",
              "3.2身份标识：如您对服务人员的身份产生任何疑问，可根据单号确认。服务人员的服务单号与您手机订单内的服务单号保持一致。若有其他相关身份上的疑问，可联系相关客服解决。"
            ]
          },
          {
            title: "4.安全责任",
            text: [
              "4.1服务人员在服务期间，由于自身原因导致发生意外事故或人身伤害，由嘉美美家负责赔偿。若因您或可归结为您的原因导致发生意外或人身伤害等，由您负责赔偿。请看管好饲养的宠物，若因您饲养的宠物导致服务人员受伤，产生的合理相关费用由您支付赔偿。",
              "4.2您有义务在服务完成后做财产安全验收，并根据实际情况如实反馈“物品是否安好”，若因服务人员导致物品损坏或者丢失，由服务人员与嘉美美家共同承担责任。若您委托服务人员进行服务（用户未在家中并确认财产安全），事后发现物品丢失或损坏，请在24小时内联系客服或者拨打电话xxxxxxxxxx,否则不予处理。",
              "4.3由于家庭服务的特殊性，以及风险的不可预估性，若服务期间导致物品的损失，嘉美美家对于财务损坏的赔偿原则上不超过本次服务价款的3倍。若因服务人员的非主观原因导致相关家电损坏等，由服务人员及嘉美美家承担相应责任，敬请谅解（注：家电操作各不相同，如条件允许，可对服务人员进行简单讲解）。",
              "4.4其他条款（根据服务性质有需要添加）"
            ]
          },
          {
            title: "5.违约及赔偿责任",
            text: [
              "嘉美美家服务人员如在服务期间有违法行为或者因个人原因对您造成损失的，嘉美美家有义务及时处理问题并承担相应责任。"
            ]
          },
          {
            title: "6.争议解决",
            text: [
              "嘉美美家与您如因服务产生分歧，应当相互沟通协商解决。如协商不成，则您可向相关机构申请调解。"
            ]
          },
        ]
      }]
    }
  ],
  userText: {
    version: '版本更新日期：xx年xx月xx日',
    intr: '为了您能更好的使用嘉美美家服务（以下简称：本服务），您应当阅读并遵守《嘉美美家服务协议》（以下简称:本协议）等相关协议、规则。',
    typeList: [{
        title: '一、总则',
        list: [
          "1.1 嘉美美家的所有权和运营权归嘉美人力资源有限公司所有。",
          "1.2 用户在注册之前，应当仔细阅读本协议，并同意遵守本协议后方可成为注册用户。一旦注册成功，则用户与嘉美美家之间自动形成协议关系，用户应当受本协议的约束。用户在使用特殊的服务或产品时，应当同意接受相关协议后方能使用。",
          "1.3 本协议由嘉美美家随时更新，用户应当及时关注并同意本站不承担通知义务。本站的通知、公告、声明或其它类似内容是本协议的一部分。"
        ]
      },
      {
        title: '二、定义条款',
        list: [
          "家庭服务：以家庭为主要服务对象，以家庭日常生活事务为主要服务内容，由家庭服务经营者提供的营利性服务活动。嘉美美家：嘉美人力资源有限公司运营和管理的网络交易平台；本协议中，嘉美美家既指网络交易平台，亦包括嘉美人力资源有限公司。用户：接受并同意本协议全部条款且具有完全民事行为能力的“嘉美美家”各项服务的使用者，即签订本协议并完成注册流程的会员。商家：通过嘉美美家从事商业活动（发布商品、信息）的个人或其他组织。"
        ]
      },
      {
        title: '三、用户服务',
        list: [
          "3.1 嘉美美家的具体服务内容由本站根据实际情况提供。",
          "3.2 本站仅提供相关的网络及家庭服务，除此之外与相关网络服务有关的设备(如个人电脑、手机、及其他与接入互联网或移动网有关的装置)及所需的费用(如为接入互联网而支付的电话费及上网费、为使用移动网而支付的手机费)均应由用户自行负担。",
          "3.3 用户有权在嘉美美家浏览家庭服务商品及信息，有权通过交易平台与商家达成家庭服务订单、支付家庭服务价款、获得电子消费凭证（如有）。",
          "3.4 用户有权按照嘉美美家发布的活动规则参与网络平台上的活动。"
        ]
      },
      {
        title: '四、用户帐号',
        list: [
          "4.1 经本站注册系统完成注册程序并通过身份认证的用户即成为正式用户，可以获得本站规定用户所应享有的一切权限；未经认证仅享有本站规定的部分会员权限。嘉美美家有权对会员的权限设计进行变更。",
          "4.2 用户只能按照注册要求使用完整、真实的个人信息进行注册，信息如有变更，应及时更新。用户有义务保证密码和帐号的安全，用户利用该密码和帐号所进行的一切活动引起的任何损失或损害，由用户自行承担全部责任，本站不承担任何责任。如用户发现帐号遭到未授权的使用或发生其他任何安全问题，应立即修改帐号密码并妥善保管，如有必要，请通知本站。因黑客行为或用户的保管疏忽导致帐号非法使用，本站不承担任何责任。"
        ]
      },
      {
        title: '五、使用规则',
        list: [
          "5.1 遵守中华人民共和国相关法律法规，包括但不限于《中华人民共和国计算机信息系统安全保护条例》、《计算机软件保护条例》、《最高人民法院关于审理涉及计算机网络著作权纠纷案件适用法律若干问题的解释(法释[2004]1号)》、《全国人大常委会关于维护互联网安全的决定》、《互联网电子公告服务管理规定》、《互联网新闻信息服务管理规定》、《互联网著作权行政保护办法》和《信息网络传播权保护条例》等有关计算机互联网规定和知识产权的法律和法规、实施办法。",
          "5.2 用户对其自行发表、上传或传送的内容负全部责任，所有用户不得在本站任何页面发布、转载、传送含有下列内容之一的信息，否则本站有权自行处理并不通知用户：(1)违反宪法确定的基本原则的； (2)危害国家安全，泄漏国家机密，颠覆国家政权，破坏国家统一的； (3)损害国家荣誉和利益的； (4)煽动民族仇恨、民族歧视，破坏民族团结的； (5)破坏国家宗教政策，宣扬邪教和封建迷信的； (6)散布谣言，扰乱社会秩序，破坏社会稳定的；(7)散布淫秽、色情、赌博、暴力、恐怖或者教唆犯罪的； (8)侮辱或者诽谤他人，侵害他人合法权益的； (9)煽动非法集会、结社、游行、示威、聚众扰乱社会秩序的； (10)以非法民间组织名义活动的；(11)含有法律、行政法规禁止的其他内容的。",
          "5.3 用户承诺对其发表或者上传于本站的所有信息(即属于《中华人民共和国著作权法》规定的作品，包括但不限于文字、图片、音乐、电影、表演和录音录像制品和电脑程序等)均享有完整的知识产权，或者已经得到相关权利人的合法授权；如用户违反本条规定造成本站被第三人索赔的，用户应全额补偿本站一切费用(包括但不限于各种赔偿费、诉讼代理费及为此支出的其它合理费用)；",
          "5.4 当第三方认为用户发表或者上传于本站的信息侵犯其权利，并根据《信息网络传播权保护条例》或者相关法律规定向本站发送权利通知书时，用户同意本站可以自行判断决定删除涉嫌侵权信息，除非用户提交书面证据材料排除侵权的可能性，本站将不会自动恢复上述删除的信息；(1)不得为任何非法目的而使用网络服务系统； (2)遵守所有与网络服务有关的网络协议、规定和程序； (3)不得利用本站进行任何可能对互联网的正常运转造成不利影响的行为； (4)不得利用本站进行任何不利于本站的行为。",
          "5.5用户承诺在嘉美美家对家庭服务商品/服务进行评价根据实际情况如实评价",
          "5.6用户承诺在嘉美美家进行家庭服务交易时，良好遵守本协议的全部交易规则，包括但不限于如下：(1)用户应当仔细阅读家庭服务交易中的全部内容，包括但不限于家庭服务商品/服务的名称、种类、数量、预约时间、有效期、营业时间、退款条件、售后服务等内容，其中用户需要特别注意商品/服务的有效期、预约时间等重要内容。用户完全接受上述交易中的全部内容方可点击购买。(2)用户提交家庭服务交易订单时，应当再次仔细阅读并确认家庭服务交易订单中的全部内容，包括但不限于家庭服务商品/服务的名称、种类、数量、预约时间、有效期、营业时间、退款条件、售后服务等内容，，确认订单后即视为用户已知晓。用户与商家均按照家庭服务合同的约定履行各自的权利与义务。(3)用户与商家确认交易并付款成功后，发生如下情况可进行退款：a)因不可抗力或商家原因，导致商家无法向用户提供家庭服务商品/服务，经核实属实后退款；b)因实际情况变化导致商家需要变更家庭服务合同内容，用户不接受变更后内容可申请退款。在发生退款时，用户应当遵守嘉美美家关于退款的有关规定。",
          "5.7 如用户在使用网络服务时违反上述任何规定，本站有权要求用户改正或直接采取一切必要的措施(包括但不限于删除用户张贴的内容、暂停或终止用户使用网络服务的权利)以减轻用户不当行为而造成的影响。"
        ]
      },
      {
        title: '六、隐私保护',
        list: [
          "6.1 本站对您的个人信息和隐私安全承担保密业务，未经您授权或同意，本网站不会将您的个人资料信息提供给第三方，但下列情况除外，且本网站不承担任何责任：(1)事先获得用户的明确授权； (2)根据有关的法律法规要求；(3)按照相关政府主管部门的要求；(4)为维护社会公众的利益。",
          "6.2 本站可能会与第三方合作向用户提供相关的网络服务，在此情况下，如该第三方同意承担与本站同等的保护用户隐私的责任，则本站有权将用户的注册资料等提供给该第三方。",
          "6.3 在不透露单个用户隐私资料的前提下，本站有权对整个用户数据库进行分析并对用户数据库进行商业上的利用。"
        ]
      },
      {
        title: '七、中断或终止服务',
        list: [
          "7.1嘉美美家需要定期或不定期地对提供网络服务的平台或相关的设备进行检修或者维护，如因此类情况而造成网络服务（包括收费网络服务）在合理时间内的中断，嘉美美家无需为此承担任何责任。嘉美美家保留不经事先通知为维修保养、升级或其它目的暂停全部或部分的网络服务的权利。",
          "7.2如发生下列任何一种情形，嘉美美家有权随时中断或终止向会员提供本协议项下的网络服务，而无需对会员或任何第三方承担任何责任。(1) 会员向嘉美美家提供的的个人信息不真实。(2) 会员违反本协议的约定或不履行其所承担的义务。(3) 用户注册的免费网络服务帐号如存在违反法律法规或国家政策要求，或侵犯任何第三方合法权益的情况。",
          "7.3会员可随时根据需要通知嘉美美家终止服务，会员服务终止后，会员使用服务的权利同时终止。自会员服务终止之时起，嘉美美家不再对该会员承担任何责任。"
        ]
      },
      {
        title: '八、版权声明',
        list: [
          "8.1 本站的文字、图片、音频、视频等版权均归嘉美人力资源有限公司享有或与作者共同享有，未经本站许可，不得任意转载。",
          "8.2 本站特有的标识、版面设计、编排方式等版权均属嘉美人力资源有限公司享有，未经本站许可，不得任意复制或转载。",
          "8.3 使用本站的任何内容均应注明“来源于嘉美美家”及署上作者姓名，按法律规定需要支付稿酬的，应当通知本站及作者及支付稿酬，并独立承担一切法律责任。",
          "8.4 本站享有所有作品用于其它用途的优先权，包括但不限于网站、电子杂志、平面出版等，但在使用前会通知作者，并按同行业的标准支付稿酬。",
          "8.5 本站所有内容仅代表作者自己的立场和观点，与本站无关，由作者本人承担一切法律责任。",
          "8.6 恶意转载本站内容的，本站保留将其诉诸法律的权利。"
        ]
      },
      {
        title: '九、责任声明',
        list: [
          "9.1 用户明确同意其使用本站网络服务所存在的风险及一切后果将完全由用户本人承担，嘉美美家对此不承担任何责任。 ",
          "9.2 本站无法保证网络服务一定能满足用户的要求，也不保证网络服务的及时性、安全性、准确性。",
          "9.3 本站不保证为方便用户而设置的外部链接的准确性和完整性，同时，对于该等外部链接指向的不由本站实际控制的任何网页上的内容，本站不承担任何责任。",
          "9.4 对于因不可抗力或本站不能控制的原因造成的网络服务中断或其它缺陷，本站不承担任何责任，但将尽力减少因此而给用户造成的损失和影响。",
          "9.5 对于本站向用户提供的下列产品或者服务的质量缺陷本身及其引发的任何损失，本站无需承担任何责任：(1)本站向用户免费提供的各项网络服务； (2)本站向用户赠送的任何产品或者服务。",
          "9.6 本站有权于任何时间暂时或永久修改或终止本服务(或其任何部分)，而无论其通知与否，本站对用户和任何第三人均无需承担任何责任。"
        ]
      },
      {
        title: '十、附则',
        list: [
          "10.1 本协议的订立、执行和解释及争议的解决均应适用中华人民共和国法律。",
          "10.2 如本协议中的任何条款无论因何种原因完全或部分无效或不具有执行力，本协议的其余条款仍应有效并且有约束力。",
          "10.3 本协议解释权及修订权归嘉美人力资源有限公司所有。"
        ]
      },
    ]
  }
}

// const userAgreement = {
//   version: '版本更新日期：xx年xx月xx日',
//   intr: '为了您能更好的使用嘉美美家服务（以下简称：本服务），您应当阅读并遵守《嘉美美家服务协议》（以下简称:本协议）等相关协议、规则。',
// }

export default agreement
